app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (upper(title) LIKE '%VINICIUS%' OR upper(genre) LIKE '%VINICIUS%' OR upper(author) LIKE '%VINICIUS%')
---
  def index
    @books = Book.by_token(@token).search(params[:term]).all

INSERT INTO "books" ("genre", "author", "pages", "grade", "title", "read", "publishing_company_id", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params.to_h.merge!({ token: @token}))

    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_book
      @book = Book.by_token(@token).find(params[:id])