app/controllers/publishing_companies_controller.rb

  def index
    @publishing_companies = PublishingCompany.all
---
SELECT "publishing_companies".* FROM "publishing_companies"

  def create
    @publishing_company = PublishingCompany.new(publishing_company_params)

    if @publishing_company.save
---
INSERT INTO "publishing_companies" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Brasil"], ["created_at", "2021-07-23 02:47:56.912918"], ["updated_at", "2021-07-23 02:47:56.912918"]]