app/controllers/users_controller.rb

  def create
    @user = User.new(user_params.to_h.merge!({ token: @token}))
    @user.token = SecureRandom.hex

    if @user.save && User.find_by(email: @user.email)
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "viniciusrdefreitas@gmail.com"], ["LIMIT", 1]]